Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Unlike the main HTTP server, the management interface does not handle _http_ and _https_ at the same time. If _https_ is configured, plain HTTP requests will be rejected.
ja_jp: メインのHTTPサーバーとは異なり、マネジメントインタフェースは _http_と _https_ を同時に扱うことはありません。_https_ が設定されている場合、プレーンの HTTP リクエストは拒否されます。

source: Unlike the previous approaches, this one leverages a declarative (annotation-based) model. Under the hood, it's not that different from the last approach. Quarkus registers a route (on the router), which then calls the `hello` method when a matching request is received. The router gets initialized during the `Quarkus.run` method. No need for the _main_ endpoint, but you can still use one, often convenient in IDEs.
ja_jp: これまでのアプローチとは異なり、このアプローチは宣言的な(アノテーションベースの)モデルを活用しています。内部では、前のアプローチとそれほど違いはありません。Quarkusは(ルーター上で)ルートを登録し、一致するリクエストを受信すると `hello` メソッドを呼び出します。ルータは、 `Quarkus.run` メソッドの間に初期化されます。 _メインエンドポイント_ は必要ありませんが、1つのエンドポイントを使用することができ、IDEでは便利なことが多いです。

source: Unlike the previous example using the _payloads_ directly, you can also use `Message` directly:
ja_jp: _ペイロード_ を直接使用する前の例とは異なり、 `Message` を直接使用することもできます。

source: Unlike with _classic_ Hibernate, you can't use `@Transactional`. Instead, we use `Panache.withTransaction` and persist our entity. The `map` is used to return a `Uni<Void>` and not a `Uni<Fruit>`.
ja_jp: _classic_ Hibernateとは異なり、 `@Transactional` を使用することはできません。 代わりに、 `Panache.withTransaction` を使用し、エンティティを永続化します。 `map` は、 `Uni<Fruit>` ではなく、 `Uni<Void>` を返すために使用します。

source: Unlike with _classic_ Hibernate, you can't use `@Transactional`. Instead, we use `session.withTransaction` and persist our entity. The `map` is used to return a `Uni<Void>` and not a `Uni<Fruit>`.
ja_jp: _classic_ Hibernate とは異なり、 `@Transactional` は使用できません。 代わりに `session.withTransaction` を使用し、エンティティーを永続化します。 `map` は、 `Uni<Fruit>` ではなく `Uni<Void>` を返すために使用されます。

source: Unlike with `@Inject` the templates obtained via `RestTemplate` are not validated, i.e. the build does not fail if a template does not exist.
ja_jp: `@Inject` とは異なり、 `RestTemplate` 経由で取得したテンプレートは検証されません。即ち、テンプレートが存在しなくてもビルドは失敗しません。

source: Unlisted Page
ja_jp: 未掲載ページ

source: Unparsed Character Data
ja_jp: パース対象外文字データ

source: Unpooled
ja_jp: アンプール

source: Unsupported Spring Scheduled functionalities
ja_jp: サポートされていないSpring Scheduledの機能

source: Until Java 19, every instance of the link:{thread}[Thread] class was a platform thread, a wrapper around an OS thread. Creating a platform thread creates an OS thread, and blocking a platform thread blocks an OS thread.
ja_jp: Java 19 までは、link:{thread}[スレッド] クラスのインスタンスはすべて、OS スレッドのラッパーであるプラットフォームスレッドでした。 プラットフォームスレッドを作成すると OS スレッドが作成され、プラットフォームスレッドがブロックされると OS スレッドもブロックされます。

source: Until https://github.com/knative/serving/issues/8471[KNative#8471] is resolved, you cannot use the management interface, as KNative does not support containers will multiple exposed ports.
ja_jp: link:https://github.com/knative/serving/issues/8471[KNative#8471] が解決されるまで、KNativeはコンテナが複数のポートを公開することをサポートしていないため、マネジメントインタフェースを使用することはできません。

source: Until now we used a simplified method of building a `HealthCheckResponse` through the `HealthCheckResponse#up(String)` (there is also `HealthCheckResponse#down(String)`) which will directly build the response object. From now on, we utilize the full builder capabilities provided by the `HealthCheckResponseBuilder` class.
ja_jp: これまでは、レスポンスオブジェクトを直接構築する `HealthCheckResponse#up(String)` （ `HealthCheckResponse#down(String)` もあります）を通して `HealthCheckResponse` を構築するという単純な方法を使っていました。今後は、 `HealthCheckResponseBuilder` クラスが提供する完全なビルダー機能を利用します。

source: Until now, all the Quarkus endpoints were exposed on the same network interface.
ja_jp: これまでは、すべてのQuarkusエンドポイントが同じネットワークインターフェイスで公開されていました。

source: Until now, if you wanted websockets support in your applications, you had to switch to Undertow.
ja_jp: これまでは、アプリケーションでWebsocketをサポートしたい場合は、Undertowに乗り換える必要がありました。

source: Until now, it was only possible to include the H2 client in native executables. Starting with Quarkus 2.14, you can also embed the H2 server in native executables.
ja_jp: これまでは、H2クライアントをネイティブ実行可能ファイルに含めることのみが可能でした。Quarkus 2.14からは、H2サーバーもネイティブ実行可能ファイルに組み込むことができるようになりました。

source: Until now, it was only possible to inject the JPA `EntityManagerFactory` and `EntityManager` in your applications. Starting with 1.11, you can inject the Hibernate ORM-specific `SessionFactory` and `Session` if you need to access their specific methods.
ja_jp: これまでは、JPA `EntityManagerFactory` と `EntityManager` をアプリケーションに注入することしかできませんでした。1.11 からは、Hibernate ORM 固有の `SessionFactory` と `Session` の特定のメソッドにアクセスする必要がある場合は、注入することができます。

source: Until now, platform threads were the concurrency unit of the JVM. They are a wrapper over OS structures. Creating a Java platform thread creates a "thread-like" structure in your operating system.
ja_jp: これまで、プラットフォームスレッドが JVM の同時実行ユニットでした。 スレッドは、OS 構造体のラッパーです。 Java プラットフォームスレッドを作成すると、オペレーティングシステムに「スレッドのような」構造が作成されます。

source: Until now, platform threads were the concurrency unit of the JVM. They are a wrapper over OS structures. This means that creating a Java platform thread actually results in creating a "thread-like" structure in your operating system.
ja_jp: これまでプラットフォームスレッドはJVMの並行処理単位でした。これはOSの構造のラッパーです。つまり、Javaプラットフォームスレッドを作成することは、実際にはOSに"スレッド(より糸)のような"構造を作成することになるのです。

source: Until now, the configuration has been the same regardless of whether you are using a JDBC or a reactive driver. After you define the database kind and credentials, the rest depends on the driver you are using. It is possible to use JDBC and a reactive driver simultaneously.
ja_jp: これまでは、JDBC ドライバーとリアクティブドライバーのどちらを使用していても、設定は同じでした。 データベースの種類とクレデンシャルを定義した後は、使用するドライバーの種類に依存します。 JDBC とリアクティブドライバーを同時に使用することも可能です。

source: Until now, the configuration has been the same regardless of whether you are using a JDBC or a reactive driver. When you have defined the database kind and the credentials, the rest depends on what type of driver you are using. It is possible to use JDBC and a reactive driver simultaneously.
ja_jp: これまでは、JDBC ドライバとReactiveドライバのどちらを使用していても、設定は同じでした。データベースの種類とクレデンシャルを定義したら、あとは使用するドライバの種類に依存します。JDBC とReactive・ドライバを同時に使用することは可能です。

source: Until now, the migration of your project had to be done via a JBang script but the update is now embedded in the Quarkus tooling (using the same OpenRewrite recipes).
ja_jp: これまでは、プロジェクトの移行はJBangスクリプトで行う必要がありましたが、Quarkusのツールにアップデートが組み込まれました（同じOpenRewriteのレシピを使用）。

source: Until now, they were not really supported and were working in JVM mode only.
ja_jp: これまでは、実際にはサポートされておらず、JVMモードでのみ動作していました。

source: Until now, we generated all projects with Java 11 as the compilation source/target. We now define the compilation source/target as Java 17 for projects generated using Java 17.
ja_jp: これまでは、すべてのプロジェクトのコンパイルソース/ターゲットをJava 11として生成していました。今後は、Java 17を使用して生成されたプロジェクトのコンパイルソース/ターゲットをJava 17と定義します。

source: Until now, we have created a GraphQL API to retrieve film data. We now want to enable the clients to retrieve the `Hero` data of the `Film`.
ja_jp: これまでは、映画のデータを取得するための GraphQL API を作成していました。今度は、クライアントが `Film` の `Hero` データを取得できるようにしたいと考えています。

source: Until now, we used a simplified method of building a `HealthCheckResponse` through the `HealthCheckResponse#up(String)` (there is also `HealthCheckResponse#down(String)`) which will directly build the response object. From now on, we utilize the full builder capabilities provided by the `HealthCheckResponseBuilder` class.
ja_jp: これまでは、レスポンスオブジェクトを直接構築する `HealthCheckResponse#up(String)` （ `HealthCheckResponse#down(String)` もあります）を通して `HealthCheckResponse` を構築するという単純な方法を使っていました。今後は、 `HealthCheckResponseBuilder` クラスが提供するビルダー機能をフルに活用します。

source: Until now, we were only supporting Oracle with JDBC. 2.7 introduces a new reactive SQL client for Oracle.
ja_jp: これまでは、JDBCによるOracleのサポートのみでした。2.7では、Oracle用の新しいリアクティブSQLクライアントを導入しました。

source: Until now, with standard Quarkus configuration, the Hibernate ORM extension only supported a single persistence unit. You could work around this limitation by using a `persistence.xml` but it was unpractical at best.
ja_jp: これまで、Quarkusの標準的な設定では、Hibernate ORMエクステンションは単一の永続化ユニットしかサポートしていませんでした。 `persistence.xml` を使用することでこの制限を回避できましたが、せいぜい実用的ではありませんでした。

source: Until now, you could configure additional HTTP headers globally. But more often than not, you need to configure HTTP headers for a specific subpath of your application.
ja_jp: これまでは、HTTPヘッダをグローバルに追加設定することができました。しかし、多くの場合、アプリケーションの特定のサブパスに対してHTTPヘッダを設定する必要があります。

source: Until now, you could only connect to one Redis instance.
ja_jp: これまでは 1 つの Redis インスタンスにしか接続できませんでした。

source: Unused Beans and Why We Remove Them
ja_jp: 未使用のBeanとそれを取り除く理由

source: Unused interceptors and decorators are not associated with any bean.
ja_jp: 未使用のインターセプターとデコレーターは、どの Bean とも関連付けられていない。

source: Up to version 2.13, Quarkus used the “space/time” GC collection policy by default, but starting with version 2.14, it switched to using the “adaptive” policy instead. The reason why Quarkus initially chose to use "space/time" is because at that time it had considerable performance improvements over "adaptive". Recent performance experiments, however, indicate that the "space/time" policy can result in worse out-of-the-box experience compared to the "adaptive" policy, while at the same time the benefits it used to offer have diminished considerably after improvements made to the "adaptive" policy. As a result, the "adaptive" policy appears to be the best option for most, if not all, Quarkus applications. Full details on this switch can be read in link:https://github.com/quarkusio/quarkus/issues/28267[this issue].
ja_jp: バージョン2.13までのQuarkusでは、デフォルトで “space/time” GCコレクションポリシーが使用されていました。しかし、バージョン2.14から、代わりに “adaptive” ポリシーを使用するように変更されました。Quarkusが当初 “space/time” を選択した理由は、当時は“adaptive” よりもパフォーマンスがかなり向上していたためです。しかし、最近の性能実験によると、 “space/time” ポリシーは “adaptive”ポリシーに比べて、すぐに使える体験が悪くなると同時に、 “adaptive”ポリシーに改良が加えられた後は、かつて提供していた利点がかなり減少していることがわかりました。その結果、 “adaptive”ポリシーは、すべてとは言わないまでも、ほとんどのQuarkusアプリケーションにとって最適な選択肢であるように思われます。この切り替えの詳細については、 link:https://github.com/quarkusio/quarkus/issues/28267[このissue] をご覧ください。

source: Up until Java 19, every instance of the link:{thread}[Thread] class was a platform thread, that is, a wrapper around an OS thread. Creating a platform threads creates an OS thread, blocking a platform thread blocks an OS thread.
ja_jp: Java 19 まではlink:{thread}[Thread] クラスのすべてのインスタンスはプラットフォームスレッド、つまり OSスレッドのラッパーでした。プラットフォームスレッドを作成するとOSスレッドが作成され、プラットフォームスレッドをブロックするとOSスレッドがブロックされます。

source: Up until `3.2`, `data-file` and `report-location` were always relative to the module's build output directory, which prevented from working with multi-module projects where you want to aggregate all coverages into a single parent directory. Starting in `3.3`, specifying a `data-file` or `report-location` will assume the path as is. Here is an example on how to set up the `surefire` plugin:
ja_jp: `3.2` までは、 `data-file` と `report-location` は常にモジュールのビルド出力ディレクトリからの相対パスでした。このため、すべてのカバレッジを1つの親ディレクトリに集約したいようなマルチモジュールプロジェクトでは作業できませんでした。 `3.3` から、 `data-file` または `report-location` を指定すると、そのパスがそのまま使われます。以下は `surefire` プラグインの設定例です：

source: Up-to-date checks allow a task's execution to be skipped, if the _inputs_ and _outputs_ of the tasks did not change. For example, consider a Java compile tasks: if the library dependencies and the source files (the _inputs_) did not change and the compiled class files (the _outputs_) are still available, compilation can be skipped.
ja_jp: up-to-date チェックでタスクの _入力_ と _出力_ が変更されていない場合は、タスクの実行をスキップできます。 たとえば Java のコンパイルタスクの場合、ライブラリーの依存関係とソースファイル (_入力_) が 変更され、コンパイルされたクラスファイル (_出力_) が引き続き使用可能であれば、コンパイルをスキップできます。

source: Update AgentExecutor Implementation
ja_jp: AgentExecutor 実装の更新

source: Update Quarkus HTTP Port
ja_jp: Quarkus HTTPポートの更新

source: Update Token Before Propagation
ja_jp: 伝搬前のトークンの更新

source: Update UserInfo with a JSON array containing private emails and pass it to the `protected.hbs` template.
ja_jp: プライベートメールを含む JSON 配列で UserInfo を更新し、それを `protected.hbs` テンプレートに渡します。

source: Update UserInfo with a JSON array containing private emails, pass it to the `userEmail` template and render it asynchronously.
ja_jp: プライベートメールを含む JSON 配列で UserInfo を更新し、それを `userEmail` テンプレートに渡して非同期にレンダリングします。

source: Update `GalaxyService` to provide search:
ja_jp: `GalaxyService` を更新し、検索を提供します:

source: Update `committed` when the batch is committed.
ja_jp: バッチがコミットされたら `committed` を更新します。

source: Update a resource, or create one, not link:{httpspec}#section-4.2.2[idempotent] (https://tools.ietf.org/html/rfc5789#section-2[HTTP docs])
ja_jp: リソースを更新するか、作成します。link:{httpspec}#section-4.2.2[idempotent] (https://tools.ietf.org/html/rfc5789#section-2[HTTP docs]) ではありません。

source: Update all package definitions and Homebrew itself
ja_jp: すべてのパッケージ定義と Homebrew 自体を更新します

source: Update code
ja_jp: コードの更新

source: Update our `GalaxyService` to provide all characters.
ja_jp: 全キャラクターを提供するために、 `GalaxyService` を更新します。

source: Update our entities to implement `SearchResult`:
ja_jp: `SearchResult` を実装するためにエンティティを更新します:

source: Update policy
ja_jp: 更新ポリシー

source: Update projects to the latest Quarkus version
ja_jp: プロジェクトをQuarkusの最新バージョンに更新

source: Update resolved dynamic tenant configuration
ja_jp: 解決された動的テナント設定を更新

source: Update the JAX-RS resource
ja_jp: JAX-RS リソースの更新

source: Update the Jakarta REST resource
ja_jp: Jakarta RESTリソースの更新

source: Update the Lambda
ja_jp: Lambda の更新

source: Update the Quarkus version
ja_jp: Quarkusのバージョンの更新

source: Update the `GalaxyService` to have some allies.
ja_jp: `GalaxyService` を更新して、味方がいるようにします。

source: Update the `oauth.client.id`, `oauth.client.secret` and `oauth.token.endpoint.uri` values.
ja_jp: `oauth.client.id`、 `oauth.client.secret`、 `oauth.token.endpoint.uri` の値を更新します。

source: Update the `org.acme.microprofile.health.DatabaseConnectionHealthCheck` class:
ja_jp: `org.acme.microprofile.health.DatabaseConnectionHealthCheck` クラスを以下のようにアップデートします:

source: Update the application to read user input
ja_jp: ユーザー入力を読み取るためにアプリケーションを更新

source: Update the document header
ja_jp: ドキュメントヘッダーの更新

source: Update the endpoint code to expect `UserInfo` as opposed to `ID token`:
ja_jp: `ID token` ではなく `UserInfo` を期待するように、エンドポイントコードを更新します。

source: Update the endpoint to accept the post logout redirects:
ja_jp: ログアウト後のリダイレクトを受け入れるようにエンドポイントを更新します。

source: Update the function
ja_jp: functionの更新

source: Update the pom.xml file to add a dependency on the narayana coordinator implementation:
ja_jp: pom.xmlファイルを更新して、narayanaコーディネーターの実装への依存関係を追加します。

source: Update the pom.xml from either the <<vertx-oidc-to-quarkus-oidc>> or <<vertx-oidc-to-quarkus-oidc-custom-callback>> sections by adding this single dependency:
ja_jp: <<vertx-oidc-to-quarkus-oidc>> または <<vertx-oidc-to-quarkus-oidc-custom-callback>> セクションの pom.xml に、この依存関係を 1 つ追加するだけです。

source: Update the tenant configuration, remove the session cookie and triger the user re-authentication. If possible, prefer to get the user log-out first, instead of triggering the re-authentication at the tenant resolution time.
ja_jp: テナント設定を更新し、セッション Cookie を削除して、ユーザーの再認証をトリガーします。可能であれば、テナント解決時に再認証をトリガーするのではなく、まずユーザーをログアウトさせることをお勧めします。

source: Update the test
ja_jp: テストの更新

source: Update token before propagation
ja_jp: 伝播前にトークンを更新する

source: Update tool
ja_jp: アップデートツール

source: Update your extension to use the `io.quarkus.oidc.client.spi.TokenProvider` CDI bean as required. For example:
ja_jp: 必要に応じて `io.quarkus.oidc.client.spi.TokenProvider` CDI Bean を使用するようにエクステンションを更新します。次に例を示します。

source: Update your extension's build file so it depends on both the `quarkus-devservices` runtime and `quarkus-devservices-deployment` modules (but see link:#version-dilemma[the discussion of choosing a Quarkus version] for implications of this).
ja_jp: エクステンションのビルドファイルを更新し、 `quarkus-devservices` ランタイムモジュールと `quarkus-devservices-deployment` モジュールの両方に依存するようにします (ただし、これによる影響については link:#version-dilemma[Quarkus バージョンの選択に関する議論] を参照してください)。

source: Updating the application configuration file
ja_jp: アプリケーション設定ファイルの更新

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] interface, i.e.:
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`]インターフェイスを更新、つまり

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] interface, i.e.:
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`]インターフェイスを更新、つまり

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/ReactiveRedisClientImpl.java[`ReactiveRedisClientImpl`], i.e.:
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/ReactiveRedisClientImpl.java[`ReactiveRedisClientImpl`]を更新、すなわち

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/RedisClientImpl.java[`RedisClientImpl`], i.e.:
ja_jp: link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/RedisClientImpl.java[`RedisClientImpl`]を更新、すなわち

source: Updating to Quarkus 3.0
ja_jp: Quarkus 3.0へのアップデート

source: Upgrade Quarkus CLI to the latest version
ja_jp: QuarkusCLI を最新バージョンにアップグレードします

source: Upgrade consumers first with `OptimisticFallbackIdHandler` (they can read both v2 and v3 messages)
ja_jp: まず、コンシューマーを `OptimisticFallbackIdHandler` でアップグレードします (v2 と v3 の両方のメッセージを読み取ることができます)。

source: Upgrade to GraalVM 21.2
ja_jp: GraalVM 21.2へのアップグレード

source: Upgrade to GraalVM/Mandrel 21.3
ja_jp: GraalVM/Mandrel 21.3へのアップグレード

source: Upgrade to GraalVM/Mandrel 22.2
ja_jp: GraalVM/Mandrel 22.2へのアップグレード

source: Upgrade to Jandex 3
ja_jp: Jandex 3へのアップグレード

source: Upgrade to Kotlin 1.5
ja_jp: Kotlin 1.5へのアップグレード

source: Upgrade to Kotlin 1.7
ja_jp: Kotlin 1.7へのアップグレード

source: Upgrade to _MP Rest Client_ 2.0 https://github.com/quarkusio/quarkus/issues/10520[#10520], which we have been waiting for, to get "follow redirects"
ja_jp: _MP Rest Client_2.0 link:https://github.com/quarkusio/quarkus/issues/10520[#10520]へのアップグレード。待望のものであり、"リダイレクトへの追従 "が可能になります。

source: Upgrade your Quarkiverse extensions to versions compatible with Quarkus 3.0
ja_jp: QuarkiverseのエクステンションをQuarkus 3.0と互換性のあるバージョンにアップグレードしてください

source: Upgrading to Hibernate ORM 6 will require some effort and testing. Make sure you have a look at the <<upgrading>> section below.
ja_jp: Hibernate ORM 6にアップグレードするには、いくらかの努力とテストが必要です。以下の <<upgrading>> セクションを必ず見てください。

source: Upgrading to Quarkus 3
ja_jp: Quarkus 3へのアップグレード

source: Upload Container Image on Azure
ja_jp: Azureへのコンテナーイメージのアップロード

source: Upload all assets, including checksums.
ja_jp: チェックサムを含むすべてのアセットをアップロードします。

source: Upload assets to JFrog Artifactory or AWS S3. We also skip this step as it's not configured.
ja_jp: JFrog ArtifactoryまたはAWS S3にアセットをアップロードします。このステップは設定しないのでこれも省略します。

source: Upon receiving a message from a Producer, a Pulsar broker assigns a `MessageId` to the message and sends it back to the producer, confirming that the message is published.
ja_jp: Pulsar ブローカーは、プロデューサーからメッセージを受信すると、メッセージに `MessageId` を割り当ててプロデューサーに送り返し、メッセージが公開されたことを確認します。

source: Usability
ja_jp: ユーザービリティー

source: Usability * easy to use * productive environment * hot reload
ja_jp: ユーザビリティ * 使いやすい * 生産的な環境 * ホットリロード

source: Usage
ja_jp: 使用方法

source: Usage analytics (telemetry collection) is invaluable for the Quarkus team and contributors to gauge which operating systems, java version, build systems, extensions and more are used. This service is provided by Red Hat and the details can be found on [usage policy](/usage/policy) page.
ja_jp: 使用状況分析（テレメトリ収集）は、Quarkusチームやコントリビューターにとって、どのオペレーティングシステム、Javaバージョン、ビルドシステム、エクステンションなどが使用されているかを測定するために非常に貴重なものです。このサービスはRed Hatによって提供されており、詳細は[usage policy](/usage/policy)ページに記載されています。

source: Usage example for `CompletionStage`
ja_jp: `CompletionStage` の使用例

source: Usage example with Mutiny
ja_jp: Mutinyとの使用例

source: Usage in containers
ja_jp: コンテナでの使用

source: Usage of `@WithTestResource`
ja_jp: `@WithTestResource` の使用法

source: Use <<bearer-token-integration-testing-keycloak-devservices,Dev Services for Keycloak>> instead of `KeycloakTestResourceLifecycleManager` for integration testing with Keycloak, unless you have specific requirements for using `KeycloakTestResourceLifecycleManager`.
ja_jp: `KeycloakTestResourceLifecycleManager` を使用する特別な要件がない限り、Keycloak との結合テストには、 `KeycloakTestResourceLifecycleManager` ではなく <<bearer-token-integration-testing-keycloak-devservices,Dev Services for Keycloak>> を使用してください。

source: Use @ApplicationScoped beans as Verticle
ja_jp: @ApplicationScopedのBeanをVerticleとして使用する

source: Use @RunOnVirtualThread with Quarkus REST (formerly RESTEasy Reactive)
ja_jp: Quarkus REST (旧 RESTEasy Reactive) で @RunOnVirtualThread を使用する

source: Use @RunOnVirtualThread with RESTEasy Reactive
ja_jp: RESTEasy Reactiveで@RunOnVirtualThreadを使用する。

source: Use ActiveMQ Artemis as a JMS implementation
ja_jp: ActiveMQ Artemis を JMS 実装として使用する

source: Use ActiveMQ Artemis as message broker
ja_jp: ActiveMQ Artemis をメッセージブローカーとして使用する

source: Use Apache Kafka, Avro serialized records, and connect to a schema registry.
ja_jp: Apache Kafkaを使用し、Avroでシリアル化されたレコードを使用し、スキーマレジストリに接続します。

source: Use Apache Kafka, Json Schema serialized records, and connect to a schema registry.
ja_jp: Apache Kafka、Json Schemaシリアライズレコード、スキーマレジストリへの接続を使用します。

source: Use Authorization Code Flow mechanism and write your own policy based on incoming request headers.
ja_jp: 認可コードフローメカニズムを使用し、受信リクエストヘッダーに基づいて独自のポリシーを作成します。

source: Use Blocking DNS lookup
ja_jp: ブロッキング DNS ルックアップを使用する

source: Use Browser
ja_jp: ブラウザの使用

source: Use CDI Constructor injection
ja_jp: CDIコンストラクタ注入の使用

source: Use CDI Constructor injection:
ja_jp: CDIコンストラクタ注入の使用：

source: Use Case - Additional Interceptor Bindings
ja_jp: ユースケース - 追加のインターセプターバインディング

source: Use Case - Additional Qualifiers
ja_jp: 使用例 - 追加の修飾子

source: Use Case - Additional Stereotypes
ja_jp: 使用例 - 追加のステレオタイプ

source: Use Case - I Have a Generated Bean Class
ja_jp: ユースケース - 生成された Bean クラスがある

source: Use Case - I Need To Transform Annotation Metadata
ja_jp: ユースケース - アノテーションのメタデータを変換する必要がある場合

source: Use Case - I Need To Transform Metadata
ja_jp: ユースケース - メタデータを変換する必要があります

source: Use Case - I Need to Validate the Deployment
ja_jp: ユースケース - デプロイメントを検証する必要がある

source: Use Case - Injection Point Transformation
ja_jp: ユースケース - インジェクションポイントの変換

source: Use Case - Inspect Beans, Observers and Injection Points
ja_jp: ユースケース - Bean、オブザーバー、インジェクションポイントの検査

source: Use Case - My Annotation Is Not Recognized as a Qualifier or an Interceptor Binding
ja_jp: ユースケース - アノテーションが修飾子またはインターセプターバインディングとして認識されない

source: Use Case - My Class Is Not Recognized as a Bean
ja_jp: ユースケース - クラスがBeanとして認識されません

source: Use Case - Register a Custom CDI Context
ja_jp: ユースケース - カスタム CDI コンテキストの登録

source: Use Case - Resource Annotations and Injection
ja_jp: ユースケース - リソースアノテーションとインジェクション

source: Use Case - Synthetic Observers
ja_jp: ユースケース - 合成オブザーバー

source: Use Case - The Need for Synthetic Beans
ja_jp: ユースケース - 合成 Bean の必要性
